stratus9/Rejestrator-PTR/Project/STM8S_StdPeriph_Template/main.c
  stop:
    //Send the stop condition
    I2C_GenerateSTOP(ENABLE);
    
    if (res) {
      //Wait for the data to be received
      timeout = 0x0FFF;
      while(!I2C_CheckEvent(I2C_EVENT_MASTER_BYTE_RECEIVED));
      if (!timeout) {
        //Error
        res = 0;
      }
      else {
        //Get the data
        data = I2C_ReceiveData();
      }
    }
  return data;
}

uint8_t I2C_ReadNByte(uint8_t address, uint8_t reg, uint8_t * data, uint8_t length){
  I2C_SendOneByte(address, reg);
  I2C_AcknowledgeConfig(I2C_ACK_CURR);
  uint8_t res = 1;
    volatile uint32_t timeout;
    uint16_t i;
  
    //Wait for the bus to be ready
    timeout = 0x0FFF;
    while(timeout-- && I2C_GetFlagStatus(I2C_FLAG_BUSBUSY));
    if (!timeout) {
      //Error
      res = 0;
      return res;
    }
    
    //Send the start condition
    I2C_GenerateSTART(ENABLE);
    timeout = 0x0FFF;
    while(timeout-- && !I2C_CheckEvent(I2C_EVENT_MASTER_MODE_SELECT));
    if (!timeout) {
      //Error
      res = 0;
      goto stop;
    }
    
    //Send the slave address
    I2C_Send7bitAddress(address, I2C_DIRECTION_RX);
    timeout = 0x0FFF;
    while(timeout-- && !I2C_CheckEvent(I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED));
    if (!timeout) {
      //Error
      res = 0;
      goto stop;
    }
    else if (SET == I2C_GetFlagStatus(I2C_FLAG_ACKNOWLEDGEFAILURE)) {
        I2C_ClearFlag(I2C_FLAG_ACKNOWLEDGEFAILURE);
        I2C_GenerateSTOP(ENABLE);
        res = 0;
        goto stop;
    }
    
    for (i=0; i<length; i++) {
      if (i == length - 1) {
        I2C_AcknowledgeConfig(I2C_ACK_NONE);
        //Send the stop condition
        I2C_GenerateSTOP(ENABLE);
      }

      //Wait for the data to be received
      timeout = 0x0FFF;
      while(timeout-- && !I2C_CheckEvent(I2C_EVENT_MASTER_BYTE_RECEIVED));
      if (!timeout) {
        //Error
        res = 0;
      }
      else {
        //Get the data
        *data = I2C_ReceiveData();
        data++;
      }
    }
    
   
  stop:
    //If something bad happened, send the stop condition
    if (!res)
      I2C_GenerateSTOP(ENABLE);
    
    return res;
}

//==========================================================================================================
//                              OLED
//==========================================================================================================
void OLED_Init(){
  OLED_Reset();
  OLED_SendCommand(0xAE);//wy³¹cz panel OLED
  //OLED_SendCommand(0x00);//adres kolumny LOW
  //OLED_SendCommand(0x10);//adres kolumny HIGH
  //OLED_SendCommand(0x40);//adres startu linii 
  
  OLED_SendCommand(0x20);//tryb adresowania strony 
  OLED_SendCommand(0x02);
  
  OLED_SendCommand(0x81);//ustaw kontrast
  OLED_SendCommand(0xCF);
  
  OLED_SendCommand(0xA0);//ustaw remapowanie    //by³o A1
  OLED_SendCommand(0xC8);//kierunek skanowania //by³o C0
  
  OLED_SendCommand(0xA8);//ustaw multiplex ratio 
  OLED_SendCommand(31);//1/64
  
  OLED_SendCommand(0xA6);//wyœwietlanie bez inwersji 
  OLED_SendCommand(0xD3);//ustaw display offset 
  OLED_SendCommand(0x00);//bez offsetu
  OLED_SendCommand(0xD5);//ustaw divide ratio/czêstotliwoœæ oscylatora
  OLED_SendCommand(0x80);//100ramek/sec
  OLED_SendCommand(0xD9);//ustaw okres pre charge
  OLED_SendCommand(0xF1);//pre charge 15 cykli, discharge 1 cykl
  OLED_SendCommand(0xDA);//konfiguracja wyprowadzeñ sterownika
  OLED_SendCommand(0x12);
  OLED_SendCommand(0xDB);//ustawienie vcomh
  OLED_SendCommand(0x40);
  OLED_SendCommand(0x8D);//ustawienie Charge Pump
  OLED_SendCommand(0x14);
  OLED_SendCommand(0xA4);//"pod³¹czenie" zawartoœci RAM do panelu OLED
  OLED_SendCommand(0xA6);//wy³¹czenie inwersji wyœwietlania
  OLED_SendCommand(0xAF);//w³¹cza wyœwietlacz
  OLED_setContrast(1);
}

void OLED_Reset(){
  GPIOD->ODR &= ~0x04;   //Enable I2C Pull-down
  Delay(100000);
  GPIOD->ODR |= 0x04;   //Enable I2C Pull-up
  Delay(100000);
}

void OLED_SendCommand(uint8_t data){
  while(I2C->SR3 & I2C_SR3_BUSY); //wait for not busy
  
  I2C_GenerateSTART(ENABLE);
  while(!(I2C->SR1 & I2C_SR1_SB)){}
  
  I2C->SR1; // Read SR1 to clear SB bit
  I2C->DR = 0x3C<<1;                            // Transmit address+W
  while(!(I2C->SR1 & I2C_SR1_TXE));
  while(!(I2C->SR1 & I2C_SR1_ADDR)){}           // Wait until address transmission is finished
  
  I2C->SR3;
  I2C->DR = 0x00;
  while(!(I2C->SR1 & I2C_SR1_TXE)){}           // Wait until address transmission is finished
  
  I2C->SR3;
  I2C->DR = data;
  while(!(I2C->SR1 & I2C_SR1_TXE)){}           // Wait until address transmission is finished
  
  I2C_GenerateSTOP(ENABLE);                    //Generate STOP
  while(!(I2C->CR2 & I2C_CR2_STOP)){}
}

void OLED_SendData(uint8_t data){
  while(I2C->SR3 & I2C_SR3_BUSY); //wait for not busy
  
  I2C_GenerateSTART(ENABLE);
  while(!(I2C->SR1 & I2C_SR1_SB)){}
  
  I2C->SR1; // Read SR1 to clear SB bit
  I2C->DR = 0x3C<<1;                            // Transmit address+W
  while(!(I2C->SR1 & I2C_SR1_TXE));
  while(!(I2C->SR1 & I2C_SR1_ADDR)){}           // Wait until address transmission is finished
  
  I2C->SR3;
  I2C->DR = 0x40;
  while(!(I2C->SR1 & I2C_SR1_TXE)){}           // Wait until address transmission is finished
  
  I2C->SR3;
  I2C->DR = data;
  while(!(I2C->SR1 & I2C_SR1_TXE)){}           // Wait until address transmission is finished
  
  I2C_GenerateSTOP(ENABLE);                    //Generate STOP
  while(!(I2C->CR2 & I2C_CR2_STOP)){}
}

void OLED_RefreshRAM(OLED_t * OLED){
  uint8_t i, j;
  
  for (i = 0; i < 4; i ++) { 
    OLED_SendCommand(0xB0 + i);
    OLED_SetColStart();   
    for (j = 0; j < 96; j ++) {
      OLED_SendData(OLED->OLED_dispBuff[j][i]); 
    }
  }  
}

void OLED_Clear(OLED_t * OLED, uint8_t fill){ 
  uint8_t i, j;
  
  for (i = 0; i < 4; i ++) {
    for (j = 0; j < 96; j ++) {
      OLED->OLED_dispBuff[j][i] = fill;
    }
  }
  
  OLED_RefreshRAM(OLED);//zawartoœæ bufora do RAM obrazu
} 

void OLED_SetColStart(void){ 
    OLED_SendCommand(0x00); //low
    OLED_SendCommand(0x12); //high
}


void OLED_DrawPoint(OLED_t * OLED, uint8_t x, uint8_t y, uint8_t p){
  uint8_t chPos, chBx, chTemp = 0;
  
  if (x > 95 || y > 31) {
    return;
  }
  chPos = y / 8; 
  chBx = y % 8;
  chTemp = 1 << (chBx);
  
