stratus9/Rejestrator-PTR/Project/STM8S_StdPeriph_Template/main.c
  if (p) {
    OLED->OLED_dispBuff[x][chPos] |= chTemp;
    
  } else {
    OLED->OLED_dispBuff[x][chPos] &= ~chTemp;
  }
}

//wyœwietlenie jednego znaku 
//argumenty:
//x,y - wspó³rzêdne na ekranie
//Chr - kod ASCII znaku 
//size - rozmiar 12, lub 16
//mode=1 znak wyœwietlany normalnie, mode=0 znak wyœwietlany w negatywie
//*******************************************************************************
void OLED_displayChar(OLED_t * OLED, uint8_t x, uint8_t y, uint8_t Chr, uint8_t size, uint8_t mode){    
  uint8_t i, j;
  uint8_t chTemp, chYpos0 = y;
  
  Chr = Chr - ' ' + 1;          
  for (i = 0; i < size; i ++) {  
    if (size == 12) {
      if (mode) {
        chTemp = c_chFont1206[Chr][i];
      } else {
        chTemp = ~c_chFont1206[Chr][i];
      }
    } else {
      if (mode) {
        chTemp = c_chFont1608[Chr][i];
      } else {
        chTemp = ~c_chFont1608[Chr][i];
      }
    }
    
    for (j = 0; j < 8; j ++) {
      if (chTemp & 0x80) {
        OLED_DrawPoint(OLED, x, y, 1);
      } else {
        OLED_DrawPoint(OLED, x, y, 0);
      }
      chTemp <<= 1;
      y ++;
      
      if ((y - chYpos0) == size) {
        y = chYpos0;
        x ++;
        break;
      }
    }  
  }
}

//*********************************************************************************
//wyœwietlenie ³añcucha znaków - napisu 
//argumenty
//x,y - wspó³rzêdne na ekranie
//*txt - wskaŸnik na pocz¹tek bufora zwieraj¹cego ³añcuch znaków ASCII do wyœwietlenia
//size - wysokoœæ znaków 12, lub 16 pikseli 
//mode=1 znaki wyœwietlane normalnie, mode=0 znaki wyœwietlane w negatywie
//*********************************************************************************
void OLED_dispTxt(OLED_t * OLED, uint8_t x, uint8_t y,  uint8_t *txt, uint8_t size, uint8_t mode){
  while (*txt != '\0') {    
    if (x > (96 - size / 2)) {
      x = 0;
      y += size;
      if (y > (32 - size)) {
        y = x = 0;
        //DisplayCls(0x00);
      }
    }
    
    OLED_displayChar(OLED, x, y, *txt, size, mode);
    x += size / 2;
    txt ++;
  }
}

void OLED_setContrast(uint8_t value){
  OLED_SendCommand(0x81);//ustaw kontrast
  OLED_SendCommand(value);
}

void OLED_int2string(char * string, uint32_t number){
  string[0] = (number>99999)?( number/100000 %10 + '0'):(' ');
  string[1] = (number>9999 )?((number/10000)%10 + '0'):(' ');
  string[2] = (number>999  )?((number/1000 )%10 + '0'):(' ');
  string[3] = (number/100  )%10 + '0';
  string[4] = '.';
  string[5] = (number/10   )%10 + '0';
  string[6] = '\0';
}

void OLED_paramTemplate(OLED_t * OLED){
  OLED_dispTxt(OLED, 0, 0,"Vmax:       m/s",12,1);
  OLED_dispTxt(OLED, 0,10,"Amax:       m/s^",12,1);
  OLED_dispTxt(OLED, 0,21,"Hmax:       m",12,1);
}

void OLED_dispInt(OLED_t * OLED, uint8_t x, uint8_t y, int32_t value){
  char bufor[7];
  OLED_int2string(bufor, value);
  
  OLED_dispTxt(OLED,x,y,bufor,12,1);
}

inline void OLED_dispVelocity(OLED_t * OLED, uint32_t value){
  OLED_dispInt(OLED, 32, 0, value);
}

inline void OLED_dispAcceleration(OLED_t * OLED, uint32_t value){
  OLED_dispInt(OLED, 32, 10, value);
}

inline void OLED_dispAltitude(OLED_t * OLED, uint32_t value){
  OLED_dispInt(OLED, 32, 21, value);
}

void OLED_drawLine(OLED_t * OLED, uint8_t x1, uint8_t y1, uint8_t x2, uint8_t y2, uint8_t mode){
  uint8_t tmp;
  uint8_t x,y;
  uint8_t dx, dy;
  int8_t err;
  int8_t ystep;
  
  uint8_t swapxy = 0;
  
  if ( x1 > x2 ) dx = x1-x2; else dx = x2-x1;
  if ( y1 > y2 ) dy = y1-y2; else dy = y2-y1;
  
  if ( dy > dx ) 
  {
    swapxy = 1;
    tmp = dx; dx =dy; dy = tmp;
    tmp = x1; x1 =y1; y1 = tmp;
    tmp = x2; x2 =y2; y2 = tmp;
  }
  if ( x1 > x2 ) 
  {
    tmp = x1; x1 =x2; x2 = tmp;
    tmp = y1; y1 =y2; y2 = tmp;
  }
  err = dx >> 1;
  if ( y2 > y1 ) ystep = 1; else ystep = -1;
  y = y1;
  
  if ( x2 == 255 ) x2--;
  
  for( x = x1; x <= x2; x++ ){
    if ( swapxy == 0 ) 
      OLED_DrawPoint(OLED, x, y, mode); 
    else 
      OLED_DrawPoint(OLED, y, x, mode); 
    err -= (uint8_t)dy;
    if ( err < 0 ){
      y += (uint8_t)ystep;
      err += (uint8_t)dx;
    }
  }
}

void OLED_drawPlotTemplate(OLED_t * OLED, char type){
  //----  X axis  ---------
  OLED_drawLine(OLED,  0, 29, 90, 29, 1);
  OLED_drawLine(OLED, 90, 29, 88, 27, 1);
  OLED_drawLine(OLED, 90, 29, 88, 31, 1);
  OLED_displayChar(OLED, 91, 20, 't', 12, 1);
    
  //---- Y axis  ----------
  OLED_drawLine(OLED, 2, 6, 2, 31, 1);
  OLED_drawLine(OLED, 2, 6, 0,  8, 1);
  OLED_drawLine(OLED, 2, 6, 4,  8, 1);
  OLED_displayChar(OLED, 4, 0, type, 12, 1);
}

void OLED_drawPlotData(OLED_t * OLED, dataset_t * data){
  
}

void datasetPrepare(dataset_t * data){
  
}

//==========================================================================================================
//                              Dev
//==========================================================================================================
void dev_CheckSensors(){
  OLED_Clear(&OLED_buffer, 0);
  
  if(I2C_ReadOneByte(0xEE, 0xD0) == 0x58) OLED_dispTxt(&OLED_buffer,0,0,"BMP  OK",12,1);
  else OLED_dispTxt(&OLED_buffer,0,0,"BMP  NOPE",12,1);
  
  if(I2C_ReadOneByte(0x3A, 0x00) == 0xE5) OLED_dispTxt(&OLED_buffer,0,12,"ADXL OK",12,1);
  else OLED_dispTxt(&OLED_buffer,0,12,"ADXL  NOPE",12,1);
  
  OLED_RefreshRAM(&OLED_buffer);
}

//==========================================================================================================
//                              BMP280
//==========================================================================================================

//==========================================================================================================
//                              ADXL345
//==========================================================================================================
void ADXL_init(){
  I2C_SendTwoBytes(0x3A, 0x2D, 0x00);
  I2C_SendTwoBytes(0x3A, 0x2D, 0x10);
  I2C_SendTwoBytes(0x3A, 0x2D, 0x08);
}

void ADXL_read(sensors_t * sensor){
  uint8_t buffer[7];
  I2C_ReadNByte(0x3A, 0x32, buffer, 6);
  sensor->accX = buffer[1]<<8 | buffer[0];
  sensor->accY = buffer[3]<<8 | buffer[2];
  sensor->accZ = buffer[5]<<8 | buffer[4];
}


#ifdef USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *   where the assert_param error has occurred.
  * @param file: pointer to the source file name
  * @param line: assert_param error line source number
  * @retval : None
  */
void assert_failed(u8* file, u32 line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
